public/notes/other/orgmode.org
#+TITLE: Org mode

#+SETUPFILE: ../level-1.org

Playing with Org mode. I realy should make some cool examples. Org is
the greatest invention of humanity, realy.

* Org sepcial blocks
I implement some js to enumarate in web blocks such as theorems,
definitions, etc. It works for both: \(\LaTeX\) and html export
** Examples
#+begin_example
#+begin_theorem
Some realy cool theorem
#+end_theorem
#+begin_proof
The proof of some realy cool theorem
#+end_proof

#+begin_theorem
Some other cool theorem
#+end_theorem
#+end_example

#+begin_theorem
Some realy cool theorem
#+end_theorem
#+begin_proof
The proof of some realy cool theorem
#+end_proof

#+begin_theorem
Some other cool theorem
#+end_theorem
* TODO Emacs config
