public/public-notes/other/orgmode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-24 Sat 03:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org mode</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yaroshevskiy Ilya" />
<link id="style" rel="stylesheet" type="text/css" href="../css/style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Org mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdb113e9">1. Org sepcial blocks</a>
<ul>
<li><a href="#orgd735f0a">1.1. Examples</a></li>
</ul>
</li>
<li><a href="#org418b4b0">2. <span class="todo TODO">TODO</span> Emacs config</a></li>
</ul>
</div>
</div>
<p>
Playing with Org mode. I realy should make some cool examples. Org is
the greatest invention of humanity, realy.
</p>

<div id="outline-container-orgdb113e9" class="outline-2">
<h2 id="orgdb113e9"><span class="section-number-2">1</span> Org sepcial blocks</h2>
<div class="outline-text-2" id="text-1">
<p>
I implement some js to enumarate in web blocks such as theorems,
definitions, etc. It works for both: \(\LaTeX\) and html export
</p>
</div>
<div id="outline-container-orgd735f0a" class="outline-3">
<h3 id="orgd735f0a"><span class="section-number-3">1.1</span> Examples</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example" id="org78c5363">
#+begin_theorem
Some realy cool theorem
#+end_theorem
#+begin_proof
The proof of some realy cool theorem
#+end_proof

#+begin_theorem
Some other cool theorem
#+end_theorem
</pre>

<div class="theorem" id="org653dd41">
<p>
Some realy cool theorem
</p>

</div>
<div class="proof" id="orgfc9dce9">
<p>
The proof of some realy cool theorem
</p>

</div>

<div class="theorem" id="orgc07511f">
<p>
Some other cool theorem
</p>

</div>
</div>
</div>
</div>
<div id="outline-container-org418b4b0" class="outline-2">
<h2 id="org418b4b0"><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> Emacs config</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yaroshevskiy Ilya</p>
<p class="date">Created: 2021-04-24 Sat 03:04</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
