public/notes/other/orgmode/index.tex
% Created 2021-04-24 Sat 00:20
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{stmaryrd}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{algorithm}
\usepackage{algorithmic}
\usepackage{lipsum}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}
\author{Yaroshevskiy Ilya}
\date{\today}
\title{Org mode}
\hypersetup{
 pdfauthor={Yaroshevskiy Ilya},
 pdftitle={Org mode},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

Playing with Org mode. I realy should make some cool examples. Org Is
the greatest invention of humanity, realy.

The 

\section{Org sepcial blocks}
\label{sec:org72370be}
I implement some js to enumarate in web blocks such as theorems,
definitions, etc. It works for both: \(\LaTeX\) and html export
\subsection{Examples}
\label{sec:orge48c3cf}
\begin{verbatim}
#+begin_theorem
Some realy cool theorem
#+end_theorem
#+begin_proof
The proof of some realy cool theorem
#+end_proof

#+begin_theorem
Some other cool theorem
#+end_theorem
\end{verbatim}

\begin{theorem}
Some realy cool theorem
\end{theorem}
\begin{proof}
The proof of some realy cool theorem
\end{proof}

\begin{theorem}
Some other cool theorem
\end{theorem}
\end{document}
